[M_SlapHappy MissionDefinition]
MissionName="No Rastro do Slappy"
MissionDescription="Sir Hammerlock contratou você para eliminar um Thresher que o mutilou há anos atrás. Pra fazer isso, você terá que tirar o velho Slappy da sua toca usando algo bem apetitoso. O braço de Sir Hammerlock pode ser a isca ideal."
TurnInDescription="O velho Slappy está morto mas, ainda é um mistério saber quem o batizou com esse nome e porquê."
MissionSummary="Elimine o velho Slappy."
MissionGiver="Sir Hammerlock"
MissionTurnInLocation="Sir Hammerlock"
TeaserText="A vingança é um prato que é melhor servido usando um canhão de comida que dispara com força suficiente para matar. Além disso, é interessante colocar veneno na comida."

[M_SlapHappy:KillSlappy MissionObjectiveDefinition]
ProgressMessage="Elimine o velho Slappy"

[M_SlapHappy:KillSlappySet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_SlapHappy:PlaceArm MissionObjectiveDefinition]
ProgressMessage="Posicione o braço"

[M_SlapHappy:PlaceArm_ObjSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_SlapHappy:RetrieveArm MissionObjectiveDefinition]
ProgressMessage="Recupere o braço"

[M_SlapHappy:RetrieveArm_ObjSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_SlapHappy:TakeArm MissionObjectiveDefinition]
ProgressMessage="Pegue o braço de Sir Hammerlock"

[M_SlapHappy:TakeArm_ObjSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

